Tekla.Structures.Internal.dotPluginInput_t
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotPluginInput_t.AllInputSet
Indicates that input is ALL done, we can call run

Tekla.Structures.Internal.dotPluginInput_t.Type
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotPluginInput_t.MoreObjectsLeft
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotPluginInput_t.InputSequence
Sequence number of input: 0, 1, 2...

Tekla.Structures.Internal.dotPluginInput_t.nObjectToStart
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotPluginInput_t.ViewId
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotPluginInput_t.IDs
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotPluginInput_t.NumItems
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotPluginInput_t.aPointX
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotPluginInput_t.aPointY
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotPluginInput_t.aPointZ
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotPluginInput_t.ClientId


Tekla.Structures.Internal.dotPluginInput_t.#ctor(System.Int32)
DO NOT USE! For internal usage only!
Size: